#!/bin/bash

# seq指令
# 用于生成某个范围内的整数

# 参数说明
# ------------------------------------------------------
# 	-f			格式化数据,使用%g表示整数,例如%g aaa%03g
# ------------------------------------------------------
# 	-s			指定字符分隔产生的所有数字(默认为\n)
# ------------------------------------------------------
# 	-w			使所有数据同宽,位数小的前面补0,不能与'-f'同时使用
# ------------------------------------------------------

# 示例

# 1.输出1-50的所有整数
seq 50

# 2.输出25-100的所有整数
seq 25 100

# 3.输出25-100,增量为5
seq 25 5 100

# 4.以特定格式输出
# 以格式'num=00025'的格式输出
seq -f "num=%05g" 25 5 100

# 5.是所有数据等宽
seq -w 99 120

# 6.以指定字符分隔数字
# 设置以空格分隔数字
seq -s " " 25 2 50




